In [1]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 2, 3, 1, 2, 3]])
data

a  1    1.354096
   2    0.779143
   3   -0.627746
b  1    0.027908
   2   -1.522154
c  3   -1.486424
   1    0.065691
d  2   -0.221468
   3   -0.337971
dtype: float64

In [2]:
data['a']

1    1.354096
2    0.779143
3   -0.627746
dtype: float64

In [3]:
data['b']

1    0.027908
2   -1.522154
dtype: float64

In [10]:
data.unstack()

          1         2         3
a  1.354096  0.779143 -0.627746
b  0.027908 -1.522154       NaN
c  0.065691       NaN -1.486424
d       NaN -0.221468 -0.337971

In [9]:
data.unstack().stack()

a  1    1.354096
   2    0.779143
   3   -0.627746
b  1    0.027908
   2   -1.522154
c  1    0.065691
   3   -1.486424
d  2   -0.221468
   3   -0.337971
dtype: float64

In [13]:
import numpy as np
import pandas as pd

frame = pd.DataFrame(np.arange(12).reshape((4,3)),
             index=[['a','a','b','b'],[1, 2, 1, 2]],
             columns=[['台北','台北','台中'],['Green','Red','Green']])
frame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [18]:
frame.stack().unstack()

       台北        台中
    Green Red Green Red
a 1     0   1   2.0 NaN
  2     3   4   5.0 NaN
b 1     6   7   8.0 NaN
  2     9  10  11.0 NaN